## Plan for org_account/roles
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| add    | `aws_iam_role.config_terraform_role`             |
|        | `aws_iam_role.s3_replicate`                      |
|        | `aws_iam_role_policy_attachment.config_tf_admin` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.config_terraform_role will be created
  + resource "aws_iam_role" "config_terraform_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringLike = {
                              + "sts:RoleSessionName" = "CBSGitHubActions"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::871282759583:role/ConfigTerraformAdministratorRole"
                          + Service = "config.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ConfigTerraformAdminExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.s3_replicate will be created
  + resource "aws_iam_role" "s3_replicate" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsSatelliteReplicateToLogArchive"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.config_tf_admin will be created
  + resource "aws_iam_role_policy_attachment" "config_tf_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "ConfigTerraformAdminExecutionRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list_in_sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_allow_policy_toggle"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.administration_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.config_terraform_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.s3_replicate"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
